In [1]:
import pandas as pd
import numpy as np
from sklearn import preprocessing

In [14]:
my_data = pd.read_csv(r"D:\python.samira\Projects\Example Projects\Mazloomi.examples\FaraDars-Film F1.txt")
my_data

   Columns1 Columns2 Columns3
0         1        a        A
1         2        a        A
2         2        a        A
3         3        b        B
4         4        b        B
5         4        b        B

In [15]:
my_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [16]:
my_data.drop_duplicates()

   Columns1 Columns2 Columns3
0         1        a        A
1         2        a        A
3         3        b        B
4         4        b        B

In [17]:
my_data.drop_duplicates(['Columns2'])#Deleting duplicates based on Columns2

   Columns1 Columns2 Columns3
0         1        a        A
3         3        b        B